Tekla.Structures.ModelInternal.dotDstvHoleLine
Serialization structure for DstvHoleLine.

Tekla.Structures.ModelInternal.dotDstvHoleLine.IsInitialized
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotDstvHoleLine.IsBlockEnd
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotDstvHoleLine.Side
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotDstvHoleLine.X
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotDstvHoleLine.Reference
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotDstvHoleLine.Y
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotDstvHoleLine.HoleType
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotDstvHoleLine.Diameter
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotDstvHoleLine.Thickness
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotDstvHoleLine.IsSlottedHole
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotDstvHoleLine.Width
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotDstvHoleLine.Height
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotDstvHoleLine.Angle
DO NOT USE! For internal usage only!